//
//  Rules.swift
//  BaseBallGame
//
//  Created by kingj on 3/13/25.
//

import Foundation

struct Rules {
    static func show() {
        print(
            "\n###########################################################################" +
            "\n#################### # BASE # BALL # GAME # RULES # #######################" +
            "\n###########################################################################" +
            "\n# [RULE 1] 1에서 9까지의 서로 다른 임의의 수 3개를 정하고 맞추는 게임입니다" +
            "\n# [RULE 2] 정답을 맞추기 위해 3자리수를 입력하고 힌트를 받습니다" +
            "\n# [RULE 3] 힌트는 야구용어인 볼과 스트라이크입니다." +
            "\n# --HINT-- 같은 자리에 같은 숫자가 있는 경우 스트라이크, 다른 자리에 숫자가 있는 경우 볼입니다" +
            "\n# --HINT-- ex) 정답 : 456 인 경우" +
            "\n# --HINT-- 435를 입력한 경우 → 1스트라이크 1볼다" +
            "\n# --HINT-- 357를 입력한 경우 → 1스트라이크" +
            "\n# --HINT-- 678를 입력한 경우 → 1볼" +
            "\n# --HINT-- 123를 입력한 경우 → Nothing" +
            "\n# [RULE 4] 약 올바르지 않은 입력값에 대해서는 오류 문구가 보여지고 재입력 받게됩니다" +
            "\n# [RULE 5] 3자리 숫자가 정답과 같은 경우 게임이 종료됩니다" +
            "\n###########################################################################" +
            "\n###########################################################################" +
            "\n###########################################################################\n"
        )
    }
}
